Repository: pressbooks/pressbooks-saml-sso
Catalog: languages/pressbooks-saml-sso-*.po
Languages: es_es, fr_fr, ja, kn

source: SAML2 Single Sign-On integration for Pressbooks (Shibboleth, Microsoft ADFS, Google Apps, etc.)
es_es: Integración con la identificación única mediante SAML2 para Pressbooks (Shibboleth, Microsoft ADFS, Google Apps, etc.).
ja: Pressbooks に対して SAML2 シングルサインオン統合 (Shibboleth、Microsoft ADFS、Google アプリなど)。

source: Failed to get IdP Metadata from URL.
es_es: No se pudieron obtener los metadatos IdP de la URL.
fr_fr: Impossible d&rsquo;obtenir les métadonnées du fournisseur d&rsquo;identité (IdP) de l&rsquo;adresse URL.
ja: URL から IdP メタデータを取得できません。
kn: ಯುಆರ್‍ಎಲ್ ನಿಂದ ಐಡಿಪಿ ಮೆಟಾಡೇಟಾ ಪಡೆಯಲು ವಿಫಲವಾಗಿದೆ.

source: The Pressbooks SAML Plugin has not been <a href="%1$s">configured</a> yet.
es_es: El plugin Pressbooks SAML aún no está <a href="%1$s">configurado</a>.
ja: Pressbooks SAML プラグインがまだ<a href="%1$s">設定</a>されていません。

source: The Pressbooks SAML Plugin is not <a href="%1$s">configured</a> correctly.
es_es: El plugin Pressbooks SAML no está <a href="%1$s">configurado</a> correctamente.
ja: Pressbooks SAML プラグインが正しく<a href="%1$s">設定</a>されていません。

source: The Pressbooks SAML Plugin failed to initialize. Error:
es_es: No se pudo inicializar el plugin Pressbooks SAML. Error:
fr_fr: Le module d&rsquo;extension SAML de Pressbook n&rsquo;a pas été initialisé. Erreur&nbsp;:
ja: Pressbooks SAML プラグインの初期化に失敗しました。エラー:
kn: ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ಎಸ್ಎಎಂಎಲ್ ಪ್ಲಗಿನ್ ಅನ್ನು ಆರಂಭಿಸಲು ವಿಫಲವಾಗಿದೆ. ದೋಷ:

source: Invalid SP metadata:
es_es: Metadatos SP no válidos:
fr_fr: Métadonnées FS invalides&nbsp;:
ja: 無効な SP メタデータ:
kn: ಅಮಾನ್ಯ ಎಸ್‍ಪಿ ಮೆಟಾಡೇಟಾ:

source: Not authenticated. Reason: %s
es_es: La identificación ha fallado. Razón: %s
fr_fr: Échec de l&rsquo;authentification. Raison&nbsp;:%s
ja: 認証に失敗しました。理由: %s
kn: ದೃಢೀಕರಿಸಿಲ್ಲ. ಕಾರಣ: %s

source: Missing SAML urn:oid:0.9.2342.19200300.100.1.1 attribute
es_es: Falta el atributo SAML urn:oid:0.9.2342.19200300.100.1.1.
ja: SAML urn:oid:0.9.2342.19200300.100.1.1 属性が見つかりません。
kn: ಕಾಣೆಯಾದ ಎಸ್ಎಎಂಎಲ್ urn:oid:0.9.2342.19200300.100.1.1 ಗುಣಲಕ್ಷಣ

source: Unable to log in: You do not have an account on this Pressbooks network. To request an account, please contact your institution's Pressbooks Network Manager%s
es_es: No se puede acceder. No tienes una cuenta en esta red de Pressbooks. Para solicitar una cuenta, contacta con el administrador de la red de Pressbooks de tu institución%s
fr_fr: Connexion impossible. Vous n&rsquo;avez pas de compte sur ce réseau Pressbooks. Pour demander un compte, veuillez contacter l&rsquo;administrateur réseau Pressbooks de votre établissement %s
ja: ログインできません: この Pressbooks サイトネットワークのアカウントをお持ちではありません。アカウントをリクエストするには、機関の Pressbooks サイトネットワーク管理者に連絡してください%s
kn: ಲಾಗ್ ಇನ್ ಮಾಡಲು ಅಸಮರ್ಥ: ಈ ಪ್ರೆಸ್ ಬುಕ್ಸ್ ನೆಟ್ ವರ್ಕ್ ನಲ್ಲಿ ನಿಮ್ಮ ಬಳಿ ಖಾತೆ ಇಲ್ಲ. ಖಾತೆಯನ್ನು ವಿನಂತಿಸಲು, ದಯವಿಟ್ಟು ನಿಮ್ಮ ಸಂಸ್ಥೆಯ ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ನೆಟ್ ವರ್ಕ್ ಮ್ಯಾನೇಜರ್ ಅನ್ನು ಸಂಪರ್ಕಿಸಿ%s

source: SAML authentication failed.
es_es: La identificación mediante SAML ha fallado.
fr_fr: Échec de l&rsquo;authentification SAML.
ja: SAML 認証に失敗しました。
kn: ಎಸ್ಎಎಂಎಲ್ ದೃಢೀಕರಣ ವಿಫಲವಾಗಿದೆ.

source: Connect via SAML2
es_es: Acceder mediante SAML
fr_fr: Se connecter par SAML2
ja: SAML2 でログイン
kn: ಎಸ್ಎಎಂಎಲ್2 ಮೂಲಕ ಸಂಪರ್ಕಿಸು

source: Or
es_es: O
fr_fr: Ou
ja: または
kn: ಅಥವಾ

source: Logged in!
es_es: ¡Te has conectado!
fr_fr: Vous êtes connecté!
ja: ログイン中 !
kn: ನೀವು ಲಾಗ್ ಇನ್ ಆಗಿದ್ದೀರಿ!

source: Registered and logged in!
es_es: ¡Te has registrado y conectado!
fr_fr: Vous êtes inscrit et connecté!
ja: 登録してログイン中 !
kn: ನೋಂದಾಯಿಸಲಾಗಿದೆ ಮತ್ತು ಲಾಗ್ ಇನ್ ಮಾಡಲಾಗಿದೆ!

source: Cannot find Pressbooks install.
es_es: No se puede encontrar la instalación de Pressbooks.
fr_fr: Erreur lors de ld&rsquo;installation de Pressbooks.
ja: Pressbooks のインストールが見つかりません。
kn: ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ಸ್ಥಾಪಿಸಲು ಸಾಧ್ಯವಿಲ್ಲ.

source: Please run <code>composer install</code> from the root of the Pressbooks SAML2 Single Sign-On plugin directory.
es_es: Ejecuta <code>composer install</code> desde la raíz del directorio del plugin Pressbooks SAML2 Single Sign-On.
fr_fr: Veuillez exécuter <code>composer install</code> depuis la source du répertoire du module d&rsquo;extension Pressbooks SAML2 à signature unique.
ja: Pressbooks SAML2 Single Sign-On プラグインディレクトリのルートから <code>composer install</code> を実行してください。
kn: ದಯವಿಟ್ಟು <code>composer install</code> ಪ್ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ಎಎಂಎಲ್2 ಸಿಂಗಲ್ ಸೈನ್-ಆನ್ ಪ್ಲಗಿನ್ ಡೈರೆಕ್ಟರಿ ಮೂಲದಿಂದ ಚಲಿಸಿ.

source: SAML2 (Security Assertion Markup Language)
es_es: SAML2 (Lenguaje de marcado para confirmaciones de seguridad)
ja: SAML2 (セキュリティ・アサーション・マークアップ言語)

source: When joining a Shibboleth or SAML2 Identity Provider (IdP) you will be asked for Service Provider (SP) configuration file. Get that here:
es_es: Al unirte a un proveedor de identidad (IdP) Shibboleth o SAML2, se te pedirá el archivo de configuración del proveedor del servicio (SP). Consíguelo aquí:
fr_fr: En vous connectant par un Shibboleth ou un fournisseur d&rsquo;identité (IdP) SAML2, vous devrez fournir le fichier de configuration du fournisseur de services (FS). Le fichier est disponible ici&nbsp;:
ja: Shibboleth または SAML2 ID プロバイダー (IdP) に参加すると、サービスプロバイダ (SP) の構成ファイルを要求されます。ここに取得します:
kn: ಶಿಬೋಲೆತ್ ಅಥವಾ ಎಸ್ಎಎಂಎಲ್2 ಗುರುತಿನ ಪೂರೈಕೆದಾರ (ಐಡಿಪಿ) ಗೆ ಸೇರುವಾಗ ನಿಮ್ಮನ್ನು ಸೇವಾ ಪೂರೈಕೆದಾರ (ಎಸ್‍ಪಿ) ಕಾನ್ಫಿಗರೇಶನ್ ಫೈಲ್‍ಗಾಗಿ ಕೇಳಲಾಗುತ್ತದೆ. ಅದನ್ನು ಇಲ್ಲಿ ಪಡೆಯಿರಿ:

source: Metadata XML Configuration
es_es: Configuración de los metadatos XML
fr_fr: Configuration XML des métadonnées
ja: メタデータ XML 設定
kn: ಮೆಟಾಡೇಟಾ ಎಕ್ಸ್ ಎಂಎಲ್ ಕಾನ್ಫಿಗರೇಶನ್

source: Automatic Configuration
es_es: Configuración automática
fr_fr: Configuration automatique
ja: 自動設定
kn: ಸ್ವಯಂಚಾಲಿತ ಕಾನ್ಫಿಗರೇಶನ್

source: If you have an IdP metadata URL, enter it here and save. The fields below should then auto-fill.
es_es: Si tienes una URL de metadatos del IdP, escríbela aquí y guarda los cambios. Los campos siguientes deberían autocompletarse.
fr_fr: Si vous avez une adresse URL des métadonnées du fournisseur d&rsquo;identité (IdP), indiquez-la ici et sauvegardez. Les champs ci-dessous devraient se remplir automatiquement.
ja: IdP メタデータ URL をお持ちの場合、ここに入力して保存します。その後で、以下のフィールドが自動入力することができます。
kn: ನೀವು ಐಡಿಪಿ ಮೆಟಾಡೇಟಾ ಯುಆರ್ ಎಲ್ ಹೊಂದಿದ್ದರೆ, ಅದನ್ನು ಇಲ್ಲಿ ನಮೂದಿಸಿ ಮತ್ತು ಉಳಿಸಿ. ಕೆಳಗಿನ ಹೊಲಗಳು ನಂತರ ಸ್ವಯಂ ಭರ್ತಿ ಮಾಡಬೇಕು.

source: Manual Configuration
es_es: Configuración manual
fr_fr: Configuration manuelle
ja: 手動設定
kn: ಮ್ಯಾನುಯಲ್ ಕಾನ್ಪಿಗರೇಷ್‍ನ್

source: Identifier of the IdP entity (must be a URI.)
es_es: Identificador de la entidad del IdP (debe ser una URI).
fr_fr: Identifiant de l&rsquo;entité du fournisseur d&rsquo;identité (IdP) (doit être une adresse URI)
ja: IdP エンティティの識別子 (URL にする必要があります)
kn: ಐಡಿಪಿ ಸಂಸ್ಥೆಯ ಐಡೆಂಟಿಫೈಯರ್ (ಯುಆರ್ಐ ಆಗಿರಬೇಕು.)

source: URL Target of the IdP where the Authentication Request Message will be sent.
es_es: Destino URL del IdP al que se enviará el mensaje de solicitud de identificación.
fr_fr: URL du fournisseur d&rsquo;identité (IdP) à laquelle la demande d&rsquo;authentification sera envoyée.
ja: 認証リクエストメッセージを送信される IdP の URL ターゲット。
kn: ದೃಢೀಕರಣ ವಿನಂತಿ ಸಂದೇಶವನ್ನು ಕಳುಹಿಸುವ ಐಡಿಪಿಯ ಯುಆರ್‍ಎಲ್ ಗುರಿ.

source: URL Location of the IdP where SLO Request will be sent.
es_es: Ubicación URL del IdP a la que se enviará la solicitud de salida única (SLO).
fr_fr: Adresse URL du fournisseur de service à laquelle la demande de déconnexion unique sera envoyée.
ja: シングルログアウトのリクエストを送信する IdP の URL 場所。
kn: ಎಸ್‍ಎಲ್‍ಒ ವಿನಂತಿಯನ್ನು ಕಳುಹಿಸುವ ಐಡಿಪಿಯ ಯುಆರ್ ಎಲ್ ಸ್ಥಳ.

source: Public x509 certificate of the IdP.
es_es: Certificado público X.509 del IdP.
fr_fr: Certificat X.509 public du fournisseur d&rsquo;identité
ja: IdP の公開 X.509 証明書。
kn: ಐಡಿಪಿಯ ಸಾರ್ವಜನಿಕ x509 ಪ್ರಮಾಣಪತ್ರ.

source: If the user does not have a Pressbooks account
es_es: Si el usuario no tiene una cuenta de Pressbooks
fr_fr: Si l&rsquo;utilisateur n&rsquo;a pas de compte Pressbooks.
ja: ユーザーは Pressbooks アカウントをお持ちでないの場合
kn: ಬಳಕೆದಾರನು ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ಖಾತೆಯನ್ನು ಹೊಂದಿಲ್ಲದಿದ್ದರೆ

source: Refuse Access
es_es: Rechazar el acceso
fr_fr: Refuser l&rsquo;accès
ja: アクセスを拒否
kn: ಪ್ರವೇಶ ನಿರಾಕರಿಸು

source: Add New User
es_es: Añadir nuevo usuario
fr_fr: Ajouter un nouvel utilisateur
ja: 新規ユーザーを追加
kn: ಬಳಕೆದಾರರನ್ನು ಸೇರಿಸಿ

source: Optional Information
es_es: Información opcional
fr_fr: Renseignements facultatifs
ja: オプションの情報
kn: ಐಚ್ಛಿಕ ಮಾಹಿತಿ

source: Bypass
es_es: Ignorar
fr_fr: Contourner
ja: バイパス
kn: ಬೈಪಾಸ್

source: Bypass the "Limited Email Registrations" and "Banned Email Domains" lists under <a href="%s">Network Settings</a>.
es_es: Ignorar las listas de «Limitar el registro por correo electrónico» y «Dominios de correo electrónico no permitidos» establecidas en <a href="%s">Ajustes de la red</a>.
fr_fr: Contourner les listes de limites d&rsquo;inscriptions par courriel et de domaines de courriel interdits dans les<a href="%s"> Paramètres réseau</a>.
ja: 「<a href="%s">サイトネットワーク設定</a>」の「登録メールアドレスの制限」と「登録を拒否するメールのドメイン」リストをバイパスします。
kn: <a href="%s">ನೆಟ್ವರ್ಕ್ ಸೆಟ್ಟಿಂಗ್ಗಳ</a>ಅಡಿಯಲ್ಲಿ "ಸೀಮಿತ ಇಮೇಲ್ ನೋಂದಣಿಗಳು" ಮತ್ತು "ನಿಷೇಧಿತ ಇಮೇಲ್ ಡೊಮೇನ್ ಗಳು" ಪಟ್ಟಿಗಳನ್ನು ಬೈಪಾಸ್ ಮಾಡಿ.

source: Forced Redirection
es_es: Redirección forzada
fr_fr: Redirection forcée
ja: 強制リダイレクト
kn: ಬಲವಂತದ ಮರುನಿರ್ದೇಶನ

source: Hide the Pressbooks login page.
es_es: Ocultar la página de acceso de Pressbooks.
fr_fr: Masquer la page de connexion Pressbooks
ja: Pressbooks ログインページを非表示
kn: ಪ್ರೆಸ್‍ಬುಕ್ಸ್ ಲಾಗಿನ್ ಪುಟವನ್ನು ಮರೆಮಾಡಿ.

source: Customize Button Text
es_es: Personalizar el texto del botón
fr_fr: Personnaliser le texte du bouton
ja: ボタンのテキストをカスタマイズ
kn: ಬಟನ್ ಪಠ್ಯವನ್ನು ಅಗತ್ಯಾನುಗುಣಗೊಳಿಸು

source: Change the [ Connect via SAML2 ] button to something more user-friendly.
es_es: Cambia el texto del botón [ Acceder mediante SAML2 ] por otro más amigable.
fr_fr: Modifier le bouton [ se connecter par SAML2] pour quelque chose de plus convivial.
ja: 「SAML2 でログイン」ボタンをより使いやすいものに変更します。
kn: [ಎಸ್ಎಎಂಎಲ್2 ಮೂಲಕ ಸಂಪರ್ಕ] ಬಟನ್ ಅನ್ನು ಹೆಚ್ಚು ಬಳಕೆದಾರ ಸ್ನೇಹಿಯಾಗಿ ಬದಲಿಸಿ.

source: Pressbooks SAML2 Single Sign-On
fr_fr: SAML2 à signature unique pour Pressbooks
kn: ಪ್ರೆಸ್‍ಬುಕ್ಸ್ SMAL2 ಸಿಂಗಲ್ ಸೈನ್-ಆನ್

source: SAML2 Single Sign-On integration for Pressbooks. (Shibboleth, Microsoft ADFS, Google Apps, etc.)
fr_fr: Intégration SAML2 à signature unique sur Pressbooks. (Shibboleth, Microsoft ADFS, Google Apps, etc.)

source: The Pressbooks SAML Plugin is not configured correctly.
fr_fr: Le module d&rsquo;extension SAML de Pressbooks n&rsquo;est pas configuré adéquatement.

source: Missing SAML attributes: uid, mail
fr_fr: Attributs SAML manquants&nbsp;: identification utilisateur, courriel

source: Pressbooks (Book Oven Inc.)
kn: ಪ್ರೆಸ್‍ಬುಕ್ಸ್ (ಬುಕ್ ಓವನ್ ಇಂಕ್.)

source: SAML2
kn: ಎಸ್.ಎ.ಎಂ.ಎಲ್.2
